In [1]:
# Perform the following operations using split-apply-combine.

# Remove all items in categories where the mean price in that category is less than $3.00.

# Find the maximum values in each category for all features. (What does Pandas take to be the maximum value of the 'item' column?)

# If the maximum price in a category is more than $3.00, reduce all prices in that category by 10%. Return a Series of the new price column.

import pandas as pd
import numpy as np

grocery = pd.DataFrame({'category':['produce', 'produce', 'meat',
                                    'meat', 'meat', 'cheese', 'cheese'],
                        'item':['celery', 'apple', 'ham', 'turkey',  'lamb',
                                'cheddar', 'brie'],
                        'price':[.99, .49, 1.89, 4.34, 9.50, 6.25, 8.0]})

grogroup = grocery.groupby('category')
grogroup

one_mean = 0

two_max = grogroup.max()

three_round = 0

In [6]:
grocery

  category     item  price
0  produce   celery   0.99
1  produce    apple   0.49
2     meat      ham   1.89
3     meat   turkey   4.34
4     meat     lamb   9.50
5   cheese  cheddar   6.25
6   cheese     brie   8.00

In [13]:
grocery.loc[3][0] #row, column

'meat'

In [15]:
grocery.iloc[1:3, 0:3]

  category   item  price
1  produce  apple   0.49
2     meat    ham   1.89

In [18]:
grocery.iloc[ :, 0:1]

  category
0  produce
1  produce
2     meat
3     meat
4     meat
5   cheese
6   cheese

In [26]:
grocery.groupby('category').sum()

          price
category
cheese    14.25
meat      15.73
produce    1.48

In [28]:
grocery.groupby('price').sum()

      category     item
price
0.49   produce    apple
0.99   produce   celery
1.89      meat      ham
4.34      meat   turkey
6.25    cheese  cheddar
8.00    cheese     brie
9.50      meat     lamb

In [44]:
grocery[grocery['price'] < 3]

# data2[data2['Incident Category']=='Non-Criminal'].head()

  category    item  price
0  produce  celery   0.99
1  produce   apple   0.49
2     meat     ham   1.89

In [33]:
grocery['price'].mean()

4.494285714285715

In [53]:
# Remove all items in categories where the mean price in that category is less than $3.00.

grocery.groupby('category')['price'].mean()

category
cheese     7.125000
meat       5.243333
produce    0.740000
Name: price, dtype: float64

In [43]:
grocery

  category     item  price
0  produce   celery   0.99
1  produce    apple   0.49
2     meat      ham   1.89
3     meat   turkey   4.34
4     meat     lamb   9.50
5   cheese  cheddar   6.25
6   cheese     brie   8.00

In [63]:
# answer to #1:

filtered = grocery.groupby('category')['price'].filter(lambda x: x.mean() >= 3)
filtered

2    1.89
3    4.34
4    9.50
5    6.25
6    8.00
Name: price, dtype: float64

In [65]:
grocery.groupby('category')['price'].mean()

category
cheese     7.125000
meat       5.243333
produce    0.740000
Name: price, dtype: float64

In [67]:
grocery

  category     item  price
0  produce   celery   0.99
1  produce    apple   0.49
2     meat      ham   1.89
3     meat   turkey   4.34
4     meat     lamb   9.50
5   cheese  cheddar   6.25
6   cheese     brie   8.00

In [66]:
# Find the maximum values in each category for all features. 
# (What does Pandas take to be the maximum value of the 'item' column?)

grocery.groupby('category').max()

             item  price
category
cheese    cheddar   8.00
meat       turkey   9.50
produce    celery   0.99

In [69]:
# If the maximum price in a category is more than $3.00, reduce all prices in that category by 10%. 
# Return a Series of the new price column.

grouped = grocery.groupby('category')['price'].max()
grouped

category
cheese     8.00
meat       9.50
produce    0.99
Name: price, dtype: float64

In [75]:
new_grocery = grouped.transform(lambda x: .9 * .1 if np.max(x) > 3 else x)
new_grocery

category
cheese     0.09
meat       0.09
produce    0.99
Name: price, dtype: float64